Revit 2027 API
ParameterTypeId.PathReinHookTypen1 Property
 "Primary Bar - Start Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinHookTypen1 { get; }
Public Shared ReadOnly Property PathReinHookTypen1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinHookTypen1 {
	ForgeTypeId^ get ();
}
static member PathReinHookTypen1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace